# Requirements:
# homebrew - http://brew.sh/
# brew bundle - https://github.com/Homebrew/homebrew-bundle
# cask - https://caskroom.github.io/ (installed automatically)
# mas-cli - https://github.com/argon/mas

# Taps
cask_args appdir: '/Applications'
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'

# Install Binaries
brew 'git'
brew 'git-lfs'
brew 'grep'
brew 'mackup'
brew 'mas'
brew 'trash'
brew 'tree'
brew 'zsh'
brew 'zsh-completions'
brew 'tmux'
brew 'curl'
brew 'wget'
brew 'grep'

# Development
brew 'node'
brew 'yarn'

# Apps
cask 'alfred'
cask 'docker'
cask 'google-chrome'
cask 'grammarly'
cask 'slack'
cask 'visual-studio-code'
cask 'dropbox'
cask 'slack'
cask 'postman'
cask 'iterm2'
cask 'zoomus'
cask 'todoist'

# Fonts
cask 'font-hack-nerd-font'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Install Mac App Store apps
mas 'Xcode', id: 497799835
mas '1Password', id: 1333542190
mas 'The Unarchiver', id: 425424353
mas 'WhatsApp', id: 1147396723 
mas 'Reeder 3', id: 880001334
mas 'Window Tidy', id: 456609775
mas 'Pixelmator', id: 407963104
mas 'TextWrangler', id: 404010395
mas 'Caffeine', id: 411246225
mas 'Helium', id: 1054607607
mas 'Fantastical 2', id: 975937182
